Repository: artiomn/sparser
Catalog: po/*.po
Languages: ru

source: Warning: "%s" is duplicated (used first value)!
ru: Предупреждение: "%s" повторяется (будет использовано первое значение).

source: Warning: unknown output format '%s' (default format will be used).
ru: Предупреждение: неизвестный формат вывода '%s' (будет использован формат по умолчанию).

source: Error: unknown configuration parameter "%s"!
ru: Ошибка: неизвестный параметр конфигурации "%s"!

source: Error: unknown stream type!
ru: Ошибка: неизвестный тип потока!

source: Error: default filename is not specified!
ru: Ошибка: имя файла по умолчанию не было задано!

source: Error: filename is not specified!
ru: Ошибка: имя файла не задано!

source: Error: can't open file "%s"!
ru: Ошибка: не могу открыть файл "%s"!

source: Error: address is not defined!
ru: Ошибка: адрес не определён!

source: Error: port is not specified!
ru: Ошибка: порт не определён!

source: Error: address conversion error!
ru: Ошибка: ошибка преобразования адреса!

source: Error: default address is not defined!
ru: Ошибка: адрес по умолчанию не определён!

source: Error: unknown %s specification in "%s"!
ru: Ошибка: неизвестная спецификация %s в "%s"!

source: Error: trailing characters after point specification "%s"!
ru: Ошибка: лишний символы после определения точки ввода-вывода "%s"!

source: Error: not allowed input source!
ru: Ошибка: недопустимый источник ввода!

source: Error: STDIN is an incorrect destination!
ru: Ошибка: STDIN - неверный приёмник!

source: Error: unknown action type in "%s"!
ru: Ошибка: неизвестный тип действия в "%s"!

source: Error: incorrect action specification "%s"!
ru: Ошибка: неизвестная спецификация действия "%s"!

source: Error: action needs parameter [%s]!
ru: Ошибка: действию требуется параметр [%s]!

source: Error: trailing characters after action specification "%s"!
ru: Ошибка: лишние символы после спецификации действия "%s"!

source: Error: pick filter from base!
ru: Ошибка: получение фильтра из базы!

source: Error: can't create actions list!
ru: Ошибка: не могу создать список действий!

source: Can't create destinations list!
ru: Не могу создать список приёмников!

source: Error: unknown output format "%s"!
ru: Ошибка: неизвестный формат вывода "%s"!

source: Error: unknown filter parameter "%s"!
ru: Ошибка: неизвестный параметр фильтра "%s"!

source: Can't load ini file:
ru: Не могу загрузить INI файл:

source: [error in line: %d]!
ru: [ошибка в строке: %d]!

source: no error
ru: нет ошибки

source: unexpected end of line
ru: неожиданный конец строки

source: general error
ru: общая ошибка

source: unknown lexeme
ru: неизвестная лексема

source: unknown operation
ru: неизвестная операция

source: unexpected bracket
ru: не ожидаемое появление скобки

source: no opening bracket
ru: отсутствует открывающая скобка

source: no trailing bracket
ru: отсутствует завершающая скобка

source: operator argument is not a field
ru: аргумент оператора - не поле

source: function code is not defined
ru: код функции не определён

source: function internal error
ru: внутренняя ошибка функции

source: function argument adding error
ru: ошибка добавления аргумента функции

source: function needs more arguments
ru: недостаточно аргументов для функции

source: function needs less arguments
ru: слишком много аргументов для данной функции

source: need comma between arguments
ru: отсутствует запятая между аргументами

source: characters after the end of expr
ru: символы после конца выражения

source: field was not found
ru: поле не найдено

source: end of parser error codes list [stub]
ru: конец списка кодов ошибок парсера [заглушка]

source: unknown error
ru: неизвестная ошибка

source: Error: %s
ru: Ошибка: %s

source: Error: message length reading error [%s]!
ru: Ошибка: не могу прочитать длину сообщения [%s]!

source: Error: memory allocation for the message buffer error [%s]!
ru: Ошибка: не могу выделить память под буфер сообщения [%s]!

source: Error: message reading error [%s]!
ru: Ошибка: не могу прочитать сообщение [%s]!

source: Error: message length recieving error [%s]!
ru: Ошибка: не могу принять длину сообщения [%s]!

source: Error: packet recieving error [%s]!
ru: Ошибка: не могу принять пакет [%s]!

source: Error: memory allocation for the message metafield (message type 0x%04X)!
ru: Ошибка: не могу выделить память для метаполя (тип сообщения 0x%04X)!

source: Error: memory allocation for the message link (message type 0x%04X)!
ru: Ошибка: memory allocation for the message link (message type 0x%04X)!

source: Error: unknown control keyword "%s" in message type 0x%04X!
ru: Ошибка: unknown control keyword "%s" in message type 0x%04X!

source: Error: can't add node "%s" [value = "%s", message type 0x%04X]!
ru: Ошибка: не могу добавить узел "%s" [значение = "%s", тип сообщения 0x%04X)!

source: Error: memory allocation for the message field (message type 0x%04X)!
ru: Ошибка: memory allocation for the message field (message type 0x%04X)!

source: Error: parsing size of field "%s" (message type 0x%04X)!
ru: Ошибка: parsing size of field "%s" (message type 0x%04X)!

source: Error: parsing output specification of field "%s" (message type 0x%04X)!
ru: Ошибка: parsing output specification of field "%s" (message type 0x%04X)!

source: Error: incorrect identifier name "%s" in message type 0x%04X
ru: Ошибка: incorrect identifier name "%s" in message type 0x%04X

source: Error: parsing output specification of header field "%s"!
ru: Ошибка: parsing output specification of header field "%s"!

source: Error: no field name in response "%s"!
ru: Ошибка: нет имени поля в ответе "%s"!

source: Error: can't find field with name "%s"!
ru: Ошибка: не могу найти поле с именем "%s"!

source: Error: can't find condition expr in response "%s"!
ru: Ошибка: отсутствует поле условного выражения в описании ответа "%s"!

source: Error: can't find error level in the response "%s"!
ru: Ошибка: отсутствует поле уровня ошибки в описании ответа "%s"!

source: Error: @elif without preceding @if [type 0x%04X]!
ru: Ошибка: @elif without preceding @if [type 0x%04X]!

source: Error: @else without preceding @if or @elif [type 0x%04X]!
ru: Ошибка: @else without preceding @if or @elif [type 0x%04X]!

source: Error: @end without preceding condition [type 0x%04X]!
ru: Ошибка: @end без предшествующего условия [тип 0x%04X]!

source: Error: link type "%d" is not defined [message type 0x%04X]!
ru: Ошибка: тип ссылки "%d" не определён [тип сообщения 0x%04X]!

source: Error: unknown node type [%d] on level %d
ru: Ошибка: unknown node type [%d] on level %d

source: Error: need @end (message type = 0x%04X)!
ru: Ошибка: требуется завершающий @end (тип сообщения = 0x%04X)!

source: unknown message
ru: неизвестное сообщение

source: Error: inner message length greater, than compound message length!
ru: Ошибка: inner message length greater, than compound message length!

source: Error: unknown IO point type (%d)!
ru: Ошибка: unknown IO point type (%d)!

source: %s [err = %d]
ru: %s [уровень ошибки = %d]

source: %s (%d bytes):
ru: %s (%d байт):

source: Remainder of message data
ru: Остаток данных

source: [correct]
ru: [корректна]

source: [Incorrect! Calculated CRC: 0x%04X]
ru: [Некорректна! Рассчитанная CRC: 0x%04X]

source: %s COMPOUND MESSAGE %s
ru: %s СОСТАВНОЕ СООБЩЕНИЕ %s

source: ***** Message data *****
ru: ***** Данные сообщения *****

source: %s ***** Simple messages ***** %s
ru: %s ***** Простые сообщения ***** %s

source: Message has not data... %s
ru: Сообщение без данных... %s

source: correct
ru: корректно

source: incorrect
ru: некорректно

source: hex data
ru: шест. данные

source: Message has not data;
ru: Сообщение без данных;

source: Error: WSAStartup %d
ru: Ошибка: WSAStartup %d

source: Error: socket creating [%s]!
ru: Ошибка: создание сокета [%s]!

source: Error: binding [%s]!
ru: Ошибка: связывание с адресом [%s]!

source: Error: connecting [%s]!
ru: Ошибка: соединение [%s]!

source: %s version: %s (build at %s)
ru: версия %s: %s (сборка от %s)

source: Usage: %s [options]
ru: Использование: %s [опции]

source: Options:
ru: Опции:

source: -f<parameters> - input source specification:
ru: -f<параметры> - спецификация источника ввода:

source: network[,address:port] - read data from UDP with specified address and port.
ru: network[,адрес:порт] - прочитать данные по UDP с указанными адресом и портом.

source: file,<filename> - read data from file.
ru: file,<имя_файла> - читать данные из файла.

source: stdin - read data from STDIN.
ru: stdin - читать данные со стандартного ввода.

source: none - don't read data by default.
ru: none - не читать данные, по умолчанию.

source: Default: %s
ru: По умолчанию: %s

source: -t<parameters> - destination specification:
ru: -t<параметры> - спецификация приёмника:

source: network[,address:port] - write data to UDP with specified address and port.
ru: network[,адрес:порт] - отправить данные по UDP с указанными адресом и портом.

source: file,<filename> - write data to file.
ru: file,<имя_файла> - записать данные в файл.

source: stdout - write data to STDOUT.
ru: stdout - записать даныне в стандартный вывод.

source: stderr - write data to STDERR.
ru: stderr - записать данные в стандартный вывод ошибок.

source: none - don't write data by default.
ru: none - не выводить данные, по умолчанию.

source: Other options:
ru: Прочие настройки:

source: -o<out_format> - default output format (default: %s).
ru: -o<тип_вывода> - тип вывода по умолчанию (по умолчанию: %s).

source: -m<messages> - messages metadata file (default: "%s").
ru: -m<сообщения> - файл метаданных сообщений (по умолчанию: "%s").

source: -r<header> - header metadata file (default: "%s").
ru: -r<заголовок> - файл метаданных заголовка (по умолчанию: "%s").

source: -s<stations> - stations database file (default: "%s").
ru: -s<станции> - файл со списком станций (по умолчанию: "%s").

source: -c<config_file> - configuration file (default: "%s").
ru: -c<конфиг> - конфигурационный файл (по умолчанию: "%s").

source: -l<filters> - filters file (default "%s").
ru: -l<фильтры> - файл с фильтрами (по умолчанию: "%s").

source: -h - print this help.
ru: -h - показать данную справку.

source: -v - print version.
ru: -v - напечатать версию.

source: %s Exiting...
ru: %s Завершение...

source: Network initialization...
ru: Инициализация сети...

source: Error: network initialization failed!
ru: Ошибка: network initialization failed!

source: Success.
ru: Успешно.

source: Error: can't register on exit function [%s]!
ru: Ошибка: не могу зарегистрировать функцию выхода [%s]!

source: Initializing...
ru: Инициализация...

source: Setting timezone to "%s"...
ru: Установка временной зоны в "%s"...

source: Warning: timezone setting failed! Time may be incorrect!
ru: Предупреждение: не удалось установить временную зону! Время может отображаться некорректно!

source: Error: can't load config "%s"!
ru: Ошибка: не могу загрузить конфиг "%s"!

source: Loading messages data from "%s"...
ru: Загрузка метаданных сообщений из "%s"...

source: Error: can't loading messages data!
ru: Ошибка: не могу загрузить метаданные сообщений!

source: Success: found %d message types.
ru: Успешно: найдено %d типов сообщений.

source: Loading stations data from "%s"...
ru: Загрузка данных станций из "%s"...

source: Warning: can't load stations data!
ru: Предупреждение: can't load stations data!

source: Success: found %d stations.
ru: Успешно: найдено %d станций.

source: Loading header metadata from "%s"...
ru: Загрузка метаданных заголовка из "%s"...

source: Error: can't load header fields metadata!
ru: Ошибка: не могу загрузить метаданные полей заголвка!

source: Loading filters from "%s"...
ru: Загрузка фильтров из "%s"...

source: Error: can't load filters!
ru: Ошибка: не могу загрузить фильтры!

source: Success: found %d filters
ru: Успешно: найдено %d фильтров

source: Decoding started...
ru: Начато декодирование...

source: Error: message processing error!
ru: Ошибка: ошибка обработки сообщения!

source: Error: station adresses limit exceeds [staion: %s, max: %d]!
ru: Ошибка: максимальное количество адресов для станции превышено [станция: %s, макс: %d]!

source: Warning: station name will be replaced [%s -> %s]!
ru: Предупреждение: параметр "название станции" повторяется и будет заменён [%s -> %s]!

source: Error: unknown station description field [%s]!
ru: Ошибка: неизвестное поле в описании станции [%s]!

source: unknown
ru: неизвестен

source: not configured
ru: не настроено

source: Error: unknown output format specifier: '%c'
ru: Ошибка: неизвестный спецификатор формата вывода: '%c'!
